class Автомобіль:
    def __init__(self, швидкість, бак):
        self.швидкість = int(швидкість)
        self.бак = int(бак)
    
    def перевірка_швидкості(self):
        if self.швидкість > 100:
            return "Швидко"
        else:
            return "Повільно"
    
    def перевірка_палива(self):
        if self.бак >= 50:
            return "Повний бак"
        else:
            return "Пустий бак"

мій_автомобіль = Автомобіль(100, 40)
print(мій_автомобіль.перевірка_швидкості())
print(мій_автомобіль.перевірка_палива())
print("________________________________________")

class Автобус(Автомобіль):
    def __init__(self, люди, швидкість):
        self.люди = int(люди)
        super().__init__(швидкість, None)
    
    def кількість_пасажирів(self):
        if self.люди == 25:
            return "Половина автобуса"
        elif self.люди < 25:
            return "Неповний автобус"
        else:
            return "Повний автобус"
        
    def перевірка_швидкості(self):
        if self.швидкість > 60:
            return "Швидко"
        else:
            return "Повільно"

мій_автобус = Автобус(40, 80)
print(мій_автобус.кількість_пасажирів())
print(мій_автобус.перевірка_швидкості())
