"""
1. Структурне програмування - це принцип програмування, який спрямована на розробку програм шляхом
 розбиття більш складних програмних конструкцій на прості і зрозумілих елементи
"""

# 2.
a = 0
if a % 2 == 0:
    print("Even")
elif a % 2 == 1:
    print("Odd")
else:
    print("Error")

# 3.
a = True
b = False
if a and b:
    print("False")

if a or b:
    print("True")

if not b:
    print("True")

# 4.
list1 = [1, 2, 3]
list2 = [1, 2, 3]

if list1 == list2:
    print("Equal")

if list1 is list2:
    print("The same")
else:
    print("They are not the same")

# 5.

for i in list1: # noqa: умова циклу
    print(i) # noqa: тіло циклу

# 6.

x = 20
y = 30
while x < y:
    print(f"{x} smaller than {y}")
    x += 5

"""
7. Оператори модифікації циклів - це спеціальні оператори, які дозволяють змінювати поведінку циклів,
 таких як for або while, під час їхнього виконання.
Ці оператори надають можливість керувати потоком виконання циклу,
 змінювати значення лічильника ітерацій, переходити до наступної ітерації або навіть перервати виконання циклу.
"""