"""
1. Використання функцій дозволяє перевикористати код в різних місцях без дублювання, що робить програму більш читабельною.
"""

# 2.


def my_func():
    print("I am a function")


# 3.

my_func()

"""
4. Параметри функції вказують на дані, які функція очікує отримати під час свого виклику.
Аргументи функції - це фіктичні передані дані.
"""

# 5.


def my_func2(name: str, age: int) -> str:
    return f"Hello {name}, you are {age} years"


"""
6. Функції першого класу - це функції які можуть бути використані так само, як і інші об'єкти, такі як цілі числа, рядки або списки.
Функції можуть бути передані як аргументи у інші функції, повернуті з функцій в результаті,
 а також призначені змінним із тим же рівнем доступу, як і для будь-якого іншого типу даних.
"""


"""
7. Функції вищого порядку - це функції, які приймають одну або декілька функцій
 як аргументи і/або повертають іншу функцію в якості результату
"""